Repository: Miro382/Good-Teacher
Catalog: Good Teacher/Strings/ManualStrings.*.resx
Languages: sk

# AddControlToCanvas
source: In the red rectangle are pages - With left click you can select page that you want to modify. Right click on page will open context menu. Currently selected page on image is third in sequence. In blue rectangle are elements that we can add to canvas. With left click on required element we will select element. After that cursor icon will change to image: plus in circle. Left click on canvas will add selected element. With right click or with key ESC you will cancel adding new element. With F5 or click on button "Run" ( Green ellipse with start icon ) will run presentation.
sk: V červených obdĺžnikoch sú stránky - ľavým tlačidlom môžete vybrať stránku ktorú chcete upravovať. Po kliknutí pravým tlačidlom na stránku sa otvorí kontextové menu. Aktuálne vybraná stránka na obrázku je 3 v poradí. V modrom obdĺžniku sú prvky ktoré môžeme pridávať do plátna. Prvok vyberieme tak, že klikneme ľavým tlačidlom myši na ten prvok, ktorý chceme pridať. Následne sa ikona kurzora zmení na obrázok: plus v kruhu. Ľavým kliknutím na plátno sa pridá daný vybraný prvok. Kliknutím pravým tlačidlom myši alebo pomocou klávesy ESC, zrušíte pridávanie nového prvku. Pomocou klávesy F5 alebo kliknutím na tlačidlo "Spustiť" (zelená elipsa s ikonou štartu) sa spustí prezentácia.

# AfterAddingPage
source: After adding page you will see in the left panel new blank page.
sk: Po pridaní stránky sa na ľavom paneli zobrazí nová prázdna stránka.

# BottomPanelDescription
source: On bottom panel are special control elements. 1. Lock - you can lock canvas to disable changes, it can prevent random mistakes. You can unlock it by click on that button again. 2. Hide page - If you want to hide page from presentation or you want to create special page, which users can only reach by action (button). 3. Zoom - You can zoom in and zoom out canvas. In textbox is current zoom. 4. Default zoom - Set zoom to default value: 100%. 5. Canvas only - Hide everything outside of canvas. 6. Alignment to grid - if you enable this option every moved element will be aligned. Alignment value can be set in settings ( Application -> Application settings -> Alignment grid size ).
sk: Na spodnom paneli sú špeciálne ovládacie prvky. 1. Zámok – Zamkne plátno. Po zamknutí plátna už nie sú možné zmeny, čím sa zabráni náhodným chybám. Môžete ho odomknúť kliknutím na tlačidlo znova. 2. Skryť stránku - Ak chcete skryť stránku z prezentácie alebo chcete vytvoriť špeciálnu stránku, na ktorú sa môžu používatelia dostať iba z akcie ( napríklad z tlačidla ). 3. Priblíženie - Môžete priblížiť a oddialiť plátno. V textovom políčku je aktuálne priblíženie. 4. Predvolené priblíženie - nastaví priblíženie na predvolenú hodnotu 100%. 5. Len plátno - Skryť všetko mimo plátna. 6. Zarovnanie do mriežky - Ak povolíte túto možnosť, všetky presúvané ovládacie prvky budú zarovnané. Hodnotu zarovnania môžete nastaviť v nastaveniach (Aplikácia -> Nastavenia aplikácie -> Veľkosť mriežky zarovnania).

# BuildWarning
source: If you want transfer presentation and you are using specific content like 3D, video or music, you must transfer together presentation file (GTCH) with "Resources" folder.
sk: Ak chcete preniesť prezentáciu a používate špeciálny obsah, ako je 3D model, video alebo hudba, musíte preniesť súbor prezentácie (GTCH) spolu so zložkou "Resources".

# CanvasControl
source: Keyboard shortcuts: * Ctrl + Mouse wheel - you can zoom in and zoom out. * Ctrl + Arrows - move canvas to direction * Page down - change page to +1 * Page up - change page to -1
sk: Klávesové skratky: * Ctrl + Kolečko myši - priblížiť alebo oddialiť plátno. * Ctrl + Šípky - posun plátna do daného smeru * Page down - zmena stránky +1 * Page up - zmena stránky -1

# CanvasGoToSettings
source: If you want to change canvas settings or presentation settings you must go to settings. You may click on settings button (Cogwheel in green rectangle) or right click on page in left panel and select customize.
sk: Ak chcete zmeniť nastavenia plátna alebo nastavenia prezentácie, musíte prejsť do nastavení. Môžete kliknúť na tlačidlo nastavenia (ozubené koliesko v zelenom obdĺžniku) alebo pravým tlačidlom myši na danú stránku v ľavom paneli a vybrať možnosť prispôsobiť.

# CanvasSettings
source: After selecting settings new window appear. You can change background color, canvas size, presentation settings or set background music. If you want change background you can select in tab 3 sections: color, gradient color or image. If you selected color, click on button ( color diagram ) -> select color -> OK. If you selected gradient color, you can select radial or linear gradient color. Then select both colors ( Start and end ), write your angle and click OK. If you selected image, click on button and select your image (More in Image selection section). You can change your canvas size by selecting default sizes from combo box or write your own size and click on button "Change canvas size".
sk: Po vybratí nastavení sa zobrazí nové okno. Môžete zmeniť farbu pozadia, veľkosť plátna, nastavenia prezentácie alebo nastaviť hudbu na pozadí. Ak chcete zmeniť pozadie, môžete vybrať na karte 3 sekcie: farba, prechodová farba alebo obrázok. Ak ste vybrali farbu, kliknite na tlačidlo (farebný diagram) -> vyberte farbu -> OK. Ak ste vybrali prechodovú farbu, môžete vybrať radiálnu alebo lineárnu prechodovú farbu. Potom vyberte obidve farby (Štart a koniec), napíšte svoj uhol a kliknite na tlačidlo OK. Ak ste vybrali obrázok, kliknite na tlačidlo a vyberte svoj obrázok (Viac v časti Výber obrázka). Veľkosť plátna môžete zmeniť výberom predvolených veľkostí zo zoznamu, alebo napísaním vlastnej veľkosti a kliknutím na tlačidlo "Zmeniť veľkosť plátna".

# EditingControls
source: If you added elements to canvas, you can edit them. Left click on the control will select it. You can resize it with green and blue points around. You can drag element with left mouse to another position. Also you can change position by dragging rectangle with cross inside it. If control is selected in right panel you will see element settings. You can change it‘s position, size, add effect ( shadow, blur ), change background... If element is selected you can delete it with delete key or button "Delete" in right panel. Every control element have specific settings. You can select more control elements. If you selected more elements, you manipulate with all of them at same time, you can move, resize or delete all of them. You can change measurement unit. In combo box units you can select your unit. You can select pixels (default), centimeters, inches or points.
sk: Ak ste pridali ovládacie prvky, môžete ich upraviť. Kliknutím ľavým tlačidlom na ovládací prvok ho vyberiete. Môžete zmeniť veľkosť pomocou zelených a modrých bodov. Prvok môžete presunúť ľavou myšou do inej pozície. Tiež môžete zmeniť pozíciu ťahaním obdĺžnika s krížom vo vnútri. Ak je v pravom paneli vybratý ovládací prvok, uvidíte nastavenia daného prvku. Môžete meniť pozíciu, veľkosť, pridať efekt (tieň, rozostrenie), zmeniť pozadie ... Ak je zvolený prvok, môžete ho odstrániť pomocou klávesy "Delete" alebo tlačidla "Vymazať" v pravom paneli. Každý ovládací prvok má špecifické nastavenia. Môžete označiť aj viac ovládacích prvkov. Ak ste vybrali viac prvkov, môžete ich presunúť, zmeniť ich veľkosť alebo ich odstrániť. Môžete taktiež zmeniť jednotku. V zozname zložiek vyberte svoju jednotku. Môžete vybrať pixely (predvolené), centimetre, palce alebo body.

# HowToAddPage
source: In the upper left corner, there is an icon (paper with plus) that adds a new page. New page is automatically selected to be edited.
sk: V ľavom hornom rohu sa nachádza ikona (papier s plusom), ktorý pridá novú stránku. Nová stránka sa automaticky vyberie na úpravu.

# Incomplete
source: The manual is currently incomplete.
sk: Príručka je momentálne neúplná.

# P1Start
source: 1. Start - Add new page, controls...
sk: 1. Začiatok - Pridať novú stranu, prvky...

# P2Canvas
source: 2. Canvas settings
sk: 2. Nastavenia plátna

# P3ImageSelection
source: 3. Image selection
sk: 3. Výber obrázka

# P4EditControls
source: 4. Editing controls
sk: 4. Úprava prvkov

# P5SaveExport
source: 5. Save and export
sk: 5. Ukladanie a export

# SaveAndExport
source: To save your project you can use shortcut Ctrl + S or File -> Save. If you want save to another file then File -> Save As. Every added image is contained in the file. If you don't use some images, you can remove them in Archive ( button with cabinet ) ( or Tools - > Archive ). You can reduce size of file by removing unused images. Every special content like video, music or 3D model is contained externally in "Resources" folder. Do not rename this folder. If you want use presentation on another computer move presentation file (GTCH) with whole "Resources" folder. You can export the entire presentation to a standalone executable program, leaving out the option of installing the program on all computers. Click on build button ( hammer ) ( Your project must be saved ) and select where to export. Select empty folder. After that you can run presentation or test anywhere where is .Net installed. Transfer whole folder (exe, data file and "Resources" folder). If you want export to pdf, image, copy to clipboard or into series of images select export and your option.
sk: Na uloženie projektu môžete použiť klávesovú skratku Ctrl + S alebo Súbor -> Úložiť. Ak chcete uložiť pod iným názvom tak Súbor -> Uložiť ako. Každý obrázok je obsiahnutý v súbore. Ak nepoužívate niektoré obrázky, môžete ich odstrániť v archíve (tlačidlo so skriňou) (alebo Nástroje -> Archív). Veľkosť súboru môžete zmenšiť odstránením nepoužívaných obrázkov. Každý špeciálny obsah, ako je video, hudba alebo 3D model, je obsiahnutý externe v priečinku "Resources". Priečinok nepremenujte. Ak chcete použiť prezentáciu na inom počítači presuňte súbor s prezentáciou (GTCH) s celým priečinkom "Resources". Dokonca môžete exportovať celú prezentáciu do samostatného spustiteľného programu a už nebude nutné inštalovať program na ostatné počítače. Kliknite na tlačidlo postaviť (kladivo) (Váš projekt musí byť uložený) a vyberte miesto exportu. Vyberte prázdnu zložku. Potom môžete spustiť prezentáciu alebo test kdekoľvek kde je .NET nainštalovaný. Presúvajte spolu celú zložku (exe, dátový súbor a priečinok "Resources"). Ak chcete exportovať do formátu PDF, obrázku, skopírovať do schránky alebo do série obrázkov, vyberte možnosť Export a vyberte to čo potrebujete.

# SelectImage
source: If you want to set image as background for canvas or element click in the section "image" on button (3 dots). After appearing of new window, you may add new images. You have 3 options: From disk, web or from clipboard. From disk – Dialog box to select images will appear. Select your image or images and then confirm. From web - write image url and click OK. From clipboard - if you have copied image in clipboard, select this option. Window with image preview will appear. Click on Add. Image will be added in to archive, and you can access it. After adding new image, thumbnail will appear. If you click on thumbnail, picture will be selected. You may delete image by click on button with trash image. If you want view all content in archive on top panel click on Archive button ( Cabinet image ) or Tools -> Archive.
sk: Ak chcete nastaviť obrázok ako pozadie pre plátno alebo prvok, kliknite v sekcii "obrázok" na tlačidlo (3 bodky). Po zobrazení nového okna môžete pridať nové obrázky. Máte tri možnosti: Z disku, z webu alebo zo schránky. Z disku - Zobrazí sa dialógové okno s výberom obrázkov. Vyberte obrázok alebo obrázky a potom potvrďte. Z webu - napíšte adresu URL obrázku a kliknite na tlačidlo OK. Zo schránky - ak ste skopírovali obrázok do schránky, vyberte túto možnosť. Zobrazí sa okno s náhľadom obrázka. Kliknite na tlačidlo Pridať. Obrázok bude pridaný do archívu a máte k nemu prístup. Po pridaní nového obrázka sa zobrazí miniatúra. Ak kliknete na miniatúru, obrázok sa vyberie. Obrázok môžete odstrániť kliknutím na tlačidlo s obrázkom koša. Ak chcete zobraziť všetok obsah v archíve, na hornom paneli kliknite na tlačidlo Archív (obrázok kabinetu) alebo Nástroje -> Archív.

# ThanksForUsing
source: Thanks for using this software. Good Teacher is a free program used for creating interactive presentations, games, graphics and tests.
sk: Ďakujeme za používanie tohto programu. Good Teacher je bezplatný program slúžiaci na vytváranie interaktívnych prezentácií, hier, grafiky a testov.
